#encoding:utf-8
#🍉西瓜数据集2.0

#属性分别为： 色泽 根蒂 敲声 纹理 脐部 触感 好瓜
#色泽 ：1 青绿  2 乌黑 3 浅白
#根蒂 ：1 蜷缩 2 稍蜷 3 硬挺
#敲声 ：1 浊响 2 沉闷 3 清脆
#纹理 ：1 清晰 2稍糊 3 模糊
#脐部 ：1 凹陷 2稍凹 3 平坦
#触感 ： 1 硬滑 2 软粘
# 青绿,蜷缩,浊响,清晰,凹陷,硬滑,好瓜
# 乌黑,蜷缩,沉闷,清晰,凹陷,硬滑,好瓜
# 乌黑,蜷缩,浊响,清晰,凹陷,硬滑,好瓜
# 浅白,蜷缩,浊响,清晰,凹陷,硬滑,好瓜
# 青绿,稍蜷,浊响,清晰,稍凹,软粘,好瓜
# 乌黑,稍蜷,浊响,稍糊,稍凹,软粘,好瓜
# 乌黑,稍蜷,浊响,清晰,稍凹,硬滑,好瓜
# 乌黑,稍蜷,沉闷,稍糊,稍凹,硬滑,坏瓜
# 青绿,硬挺,清脆,清晰,平坦,软粘,坏瓜
# 浅白,硬挺,清脆,模糊,平坦,硬滑,坏瓜
# 浅白,蜷缩,浊响,模糊,平坦,软粘,坏瓜
# 青绿,稍蜷,浊响,稍糊,凹陷,硬滑,坏瓜
# 浅白,稍蜷,沉闷,稍糊,凹陷,硬滑,坏瓜
# 乌黑,稍蜷,浊响,清晰,稍凹,软粘,坏瓜
# 浅白,蜷缩,浊响,模糊,平坦,硬滑,坏瓜
# 青绿,蜷缩,沉闷,稍糊,稍凹,硬滑,坏瓜
watermelon_D = (
[1,1,1,1,1,1,1],
[2,1,2,1,1,1,1],
[2,1,1,1,1,1,1],
[1,1,2,1,1,1,1],
[3,1,1,1,1,1,1],
[1,2,1,1,2,2,1],
[2,2,1,2,2,2,1],
[2,2,1,1,2,1,1],
[2,2,2,2,2,1,2],
[1,3,3,1,3,2,2],
[3,3,3,3,3,1,2],
[3,1,1,3,3,2,2],
[1,2,1,2,1,1,2],
[3,2,2,2,1,1,2],
[2,2,1,1,2,2,2],
[3,1,1,3,3,1,2],
[1,1,2,2,2,1,2])

watermelon_attri = {u"色泽":0,u"根蒂":1,u"敲声":2,u"纹理":3,u"脐部":4,u"触感":5,u"好坏":6}