#encoding:utf-8
#🍉西瓜数据集2.0

#属性分别为： 色泽 根蒂 敲声 纹理 脐部 触感 好瓜
#色泽 ：1 青绿  2 乌黑 3 浅白
#根蒂 ：1 蜷缩 2 稍蜷 3 硬挺
#敲声 ：1 浊响 2 沉闷 3 清脆
#纹理 ：1 清晰 2稍糊 3 模糊
#脐部 ：1 凹陷 2稍凹 3 平坦
#触感 ： 1 硬滑 2 软粘
# 青绿,蜷缩,浊响,清晰,凹陷,硬滑,好瓜
# 乌黑,蜷缩,沉闷,清晰,凹陷,硬滑,好瓜
# 乌黑,蜷缩,浊响,清晰,凹陷,硬滑,好瓜
# 浅白,蜷缩,浊响,清晰,凹陷,硬滑,好瓜
# 青绿,稍蜷,浊响,清晰,稍凹,软粘,好瓜
# 乌黑,稍蜷,浊响,稍糊,稍凹,软粘,好瓜
# 乌黑,稍蜷,浊响,清晰,稍凹,硬滑,好瓜
# 乌黑,稍蜷,沉闷,稍糊,稍凹,硬滑,坏瓜
# 青绿,硬挺,清脆,清晰,平坦,软粘,坏瓜
# 浅白,硬挺,清脆,模糊,平坦,硬滑,坏瓜
# 浅白,蜷缩,浊响,模糊,平坦,软粘,坏瓜
# 青绿,稍蜷,浊响,稍糊,凹陷,硬滑,坏瓜
# 浅白,稍蜷,沉闷,稍糊,凹陷,硬滑,坏瓜
# 乌黑,稍蜷,浊响,清晰,稍凹,软粘,坏瓜
# 浅白,蜷缩,浊响,模糊,平坦,硬滑,坏瓜
# 青绿,蜷缩,沉闷,稍糊,稍凹,硬滑,坏瓜

#训练集1，2，3，6，7，10，14，15，16，17
#验证集4，5，8，9，11，12，13
watermelon_D = (
[1,1,1,1,1,1,1,1],
[2,2,1,2,1,1,1,1],
[3,2,1,1,1,1,1,1],
[4,1,1,2,1,1,1,1],
[5,3,1,1,1,1,1,1],
[6,1,2,1,1,2,2,1],
[7,2,2,1,2,2,2,1],
[8,2,2,1,1,2,1,1],
[9,2,2,2,2,2,1,2],
[10,1,3,3,1,3,2,2],
[11,3,3,3,3,3,1,2],
[12,3,1,1,3,3,2,2],
[13,1,2,1,2,1,1,2],
[14,3,2,2,2,1,1,2],
[15,2,2,1,1,2,2,2],
[16,3,1,1,3,3,1,2],
[17,1,1,2,2,2,1,2])

watermelon_attri = {u"编号":0,u"色泽":1,u"根蒂":2,u"敲声":3,u"纹理":4,u"脐部":5,u"触感":6,u"好坏":7}

wm_trainningset = [watermelon_D[x-1] for x in [1,2,3,6,7,10,14,15,16,17]]
wm_validationset = [watermelon_D[x-1] for x in [4,5,8,9,11,12,13]]
